package ua.edu.ucu.immutable;

// У результаті змін, що призводять на модифікації (зміну стану)
// колекції має повртатись нова колекція
public interface ImmutableList {

    // додає масив елементів починаючи з зазначеного індекса, та кидає виключну
    // ситуацію, якщо індекс виходить за межі колекції
    ImmutableList addAll(int index, Object[] c);

    //повертає елемент за індексом, та кидає виключну ситуацію,
    // якщо індекс виходить за межі колекції
    Object get(int index);

    //видаляє елемент за індексом, та кидає виключну ситуацію,
    // якщо індекс виходить за межі колекції
    ImmutableList remove(int index);

    //якщо у колеції нема елементів то повертає true
    boolean isEmpty();
}
